Documents/НазначениеПодрядчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НазначениеПодрядчика</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комплект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
								<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипВнешнегоПроизводства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыВнешнегоПроизводства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыВнешнегоПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыВнешнегоПроизводства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПКД_РКД_Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РКД_Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Проекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВедущийКонструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дизайнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаРазрываДляГанта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьДоговор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замерщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКорневойПапкиВPDM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПапкиГЧВPDM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПапкиКомпозицииВPDM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьНаДиаграмму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сметчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МатериалыПроекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МатериалыПроектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/НазначениеПодрядчика/Forms/ФормаДокумента/Ext/Form/Module.bsl
Функция ПолучитьПроекты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК Ссылка,
		|	Проекты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НазначениеПодрядчика КАК НазначениеПодрядчика
		|		ПО НазначениеПодрядчика.Проект = Проекты.Ссылка
		|ГДЕ
		|	НЕ Проекты.НеВыводитьНаДиаграмму
		|	И НазначениеПодрядчика.Проект ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокПроектов = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		СписокПроектов.Добавить(Выборка.Ссылка, Выборка.Наименование); 
	КонецЦикла;
	
	Возврат СписокПроектов;
	
КонецФункции // ПолучитьПроекты()

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
	
		Элементы.Проект.ТолькоПросмотр = Истина;
		Элементы.Проект.СписокВыбора.Добавить(Объект.Проект);
		
	Иначе
		
		Для каждого ТекущийПроект Из ПолучитьПроекты() Цикл
			Элементы.Проект.СписокВыбора.Добавить(ТекущийПроект.Значение, ТекущийПроект.Представление);
		КонецЦикла;
		
	КонецЕсли;
	
	ВываестиНаСервере();
	
КонецПроцедуры

Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Ссылка,
		|	ИзделияКомплект.Родитель.Композиция КАК Композиция
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Проект = &Проект
		|	И НЕ ИзделияКомплект.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИзделияКомплект.Родитель.Композиция.Наименование,
		|	ИзделияКомплект.Наименование";
	
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	стОтбор = Новый Структура("Комплект", );
	
	Пока Выборка.Следующий() Цикл
		
		стОтбор.Комплект = Выборка.Ссылка;
		
		Если Объект.Комплекты.НайтиСтроки(стОтбор).Количество() = 0 Тогда
		
			НС = Объект.Комплекты.Добавить();
			НС.Комплект = Выборка.Ссылка;
		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Композиция) Тогда
		
			стОтбор.Комплект = Выборка.Композиция;
			
			Если Объект.Комплекты.НайтиСтроки(стОтбор).Количество() = 0 Тогда
				
				НС = Объект.Комплекты.Добавить();
				НС.Комплект = Выборка.Композиция;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		
		ЗаполнитьНаСервере();
		ВываестиНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВываестиНаСервере()

	ДеревоКомплектов.ПолучитьЭлементы().Очистить();
	
	мКомпозиции = Новый Массив;
	мКомплекты 	= Новый Массив;
	
	ТипКомпозиция = Тип("СправочникСсылка.Композиции");
	
	Для каждого СтрокаКомплект Из Объект.Комплекты Цикл
	
		Если ТипЗнч(СтрокаКомплект.Комплект) = ТипКомпозиция  Тогда
		
			мКомпозиции.Добавить(СтрокаКомплект.Комплект);
			
		Иначе

			мКомплекты.Добавить(СтрокаКомплект.Комплект);
			
		КонецЕсли;	
	
	КонецЦикла;       
	
    ДанныеДЗ = РеквизитФормыВЗначение("ДеревоКомплектов");
	
	ОтборКомпозиция = Новый Структура("Композиция", 	);
	ОтборКомплект 	= Новый Структура("Комплект", 	);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Комплект,
		|	ИзделияКомплект.Родитель.Композиция КАК Композиция
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Родитель.Композиция В(&Композиция)
		|	И НЕ ИзделияКомплект.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Композиция", мКомпозиции);
	
	ТаблицаСостояний = Запрос.Выполнить().Выгрузить();
	
	Для каждого ТекущаяКомпозиция Из мКомпозиции Цикл
	
		ОтборКомпозиция.Композиция 	= ТекущаяКомпозиция;
		ОтборКомплект.Комплект 		= ТекущаяКомпозиция;
		
		СтрокаКомпозиции = ДанныеДЗ.Строки.Добавить();
		СтрокаКомпозиции.Комплект = ТекущаяКомпозиция;
		
		НайденыеСрокиКомплектов = Объект.Комплекты.НайтиСтроки(ОтборКомплект);
		Если НайденыеСрокиКомплектов.Количество() > 0 Тогда
			СтрокаКомпозиции.ТипВнешнегоПроизводства = НайденыеСрокиКомплектов[0].ТипВнешнегоПроизводства;	
		КонецЕсли;
		
		НайденыеСроки = ТаблицаСостояний.НайтиСтроки(ОтборКомпозиция);
		Для каждого Комплект Из НайденыеСроки Цикл
		
			СтрокаКомплекта = СтрокаКомпозиции.Строки.Добавить();
			СтрокаКомплекта.Комплект = Комплект.Комплект;
			
			ОтборКомплект.Комплект 	= Комплект.Комплект;
			НайденыеСрокиКомплектов = Объект.Комплекты.НайтиСтроки(ОтборКомплект);
			Если НайденыеСрокиКомплектов.Количество() > 0 Тогда
				СтрокаКомпозиции.ТипВнешнегоПроизводства = НайденыеСрокиКомплектов[0].ТипВнешнегоПроизводства;	
			КонецЕсли; 
			
			мКомплекты.Удалить(мКомплекты.Найти(Комплект.Комплект));
			
		КонецЦикла;
		
	
	КонецЦикла;
	
	Для каждого ТекущийКомплект Из мКомплекты Цикл
		
		СтрокаКомпозиции = ДанныеДЗ.Строки.Добавить();
		СтрокаКомпозиции.Комплект 	= ТекущийКомплект;
		ОтборКомплект.Комплект 		= ТекущийКомплект;
		
		НайденыеСрокиКомплектов = Объект.Комплекты.НайтиСтроки(ОтборКомплект);
		Если НайденыеСрокиКомплектов.Количество() > 0 Тогда
			СтрокаКомпозиции.ТипВнешнегоПроизводства = НайденыеСрокиКомплектов[0].ТипВнешнегоПроизводства;	
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДанныеДЗ, "ДеревоКомплектов");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Комплекты.Очистить();
	ОбойтиРекурсивноСтрокиДереваНаКлиенте(ДеревоКомплектов.ПолучитьЭлементы())
КонецПроцедуры 

&НаКлиенте
Процедура ОбойтиРекурсивноСтрокиДереваНаКлиенте(Строки)
	Для Каждого СтрокаДерева Из Строки Цикл  
		
		ЗаполнитьЗначенияСвойств(Объект.Комплекты.Добавить(), СтрокаДерева);
         
        ПодчиненныеСтроки  = СтрокаДерева.ПолучитьЭлементы();
         
        Если ПодчиненныеСтроки.Количество() > 0 Тогда
            ОбойтиРекурсивноСтрокиДереваНаКлиенте(ПодчиненныеСтроки);
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ДеревоКомплектовТипВнешнегоПроизводстваНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТД = Элементы.ДеревоКомплектов.ТекущиеДанные; 
	
	Элемент.СписокВыбора.Очистить();
	Если ТипЗнч(ТД.Комплект) = Тип("СправочникСсылка.Композиции") Тогда
		Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыВнешнегоПроизводства.ПустаяСсылка"));
		Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыВнешнегоПроизводства.ПКД_РКД_Производство"));
	Иначе
		
		ИдентификаторСтроки = Элементы.ДеревоКомплектов.ТекущаяСтрока;
		ТекущаяСтрока       = ДеревоКомплектов.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаРодитель      = ТекущаяСтрока.ПолучитьРодителя();
		
		Если СтрокаРодитель = Неопределено Тогда
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыВнешнегоПроизводства.ПустаяСсылка"));
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыВнешнегоПроизводства.ПКД_РКД_Производство"));
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыВнешнегоПроизводства.РКД_Производство"));
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыВнешнегоПроизводства.Производство"));
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаРодитель.ТипВнешнегоПроизводства) Тогда
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыВнешнегоПроизводства.ПустаяСсылка"));
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыВнешнегоПроизводства.ПКД_РКД_Производство"));
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыВнешнегоПроизводства.РКД_Производство"));
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыВнешнегоПроизводства.Производство"));
		Иначе
			СтандартнаяОбработка = Ложь;	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКомплектовТипВнешнегоПроизводстваПриИзменении(Элемент)
	ТД = Элементы.ДеревоКомплектов.ТекущиеДанные;
	Если ТипЗнч(ТД.Комплект) = Тип("СправочникСсылка.Композиции") Тогда
		ИдентификаторСтроки = Элементы.ДеревоКомплектов.ТекущаяСтрока;
		ТекущаяСтрока       = ДеревоКомплектов.НайтиПоИдентификатору(ИдентификаторСтроки);
		Для каждого х Из ТекущаяСтрока.ПолучитьЭлементы() Цикл
		
			х.ТипВнешнегоПроизводства = ТД.ТипВнешнегоПроизводства;	
		
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
